// 1 завдання
/* до Call Stack додається 
1 - консоль лог та виконується 
2 - створюється об'єкт промісу та присвоюється константі  promise1
  далі виконується тіло промісу де до колстеку потрапляє консоль лог з 1 та виконується, а проміс отримує статус fulfilled та
  з результатом виконання потрапляє до веб апі
3 - до колстеку потрапляє виклик промісу та очікує результат виконання промісу 
4 - до колстеку додається консоль лог end та виконується
5 - з веб апі викликається проміс та береться його значення для виконання консоль логу в середині
Результат виконання
start
1
end
2
*/

/* 1 в консоль виводиться start, перша виконана функція в коді*/
console.log('start'); 
/* 2 присвоєння promise1 нового промісу та виконання коду промісу відразу
тому ми бачимо консоль лог відразу, потім проміс повертає результат виконання "2" */
const promise1 = new Promise((resolve) => {
console.log(1);
resolve(2);
})

/* 4  отримання результату промісу */
promise1.then(res => {
console.log(res);
});
/* 3 відображення в консолі end в порядку читання коду*/
console.log('end');