const promise = new Promise(res => res(2));
	promise.then(v => {
	        console.log(v); //відображаємо в консолі результат промісу "2"
	        return v * 2; // змінюємо результат промісу на "4" та передємо далі по лацюгу
	    })
	    .then(v => {
	        console.log(v); //відображаємо результат промісу "4"
	        return v * 2;   //змінюємо результат виконання промісу на "8"
	    })
	    .finally(v => {
	        console.log(v); //отримаємо undefined тому що finally не працює з результатом виконання промісу, він прокидує його в наступні обробники
	        return v * 2; //нічого не повертає, результат ігнорується
	    })
	    .then(v => {
	        console.log(v); //відображаємо останній результат виконання промісу "8", нічого не зміюємо оскільки нічого не повертаємо.
	    });